Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.7.83/samg51/atdf/ATSAMG51G18.atdf
        <register caption="Channel Sequence Register 1" name="ADC_SEQR1" offset="0x08" rw="RW" size="4">
          <bitfield caption="User Sequence Number 1" mask="0x0000000F" name="USCH1"/>
          <bitfield caption="User Sequence Number 2" mask="0x000000F0" name="USCH2"/>
          <bitfield caption="User Sequence Number 3" mask="0x00000F00" name="USCH3"/>
          <bitfield caption="User Sequence Number 4" mask="0x0000F000" name="USCH4"/>
          <bitfield caption="User Sequence Number 5" mask="0x000F0000" name="USCH5"/>
          <bitfield caption="User Sequence Number 6" mask="0x00F00000" name="USCH6"/>
          <bitfield caption="User Sequence Number 7" mask="0x0F000000" name="USCH7"/>
        </register>
        <register caption="Channel Enable Register" name="ADC_CHER" offset="0x10" rw="W" size="4" atomic-op="set:ADC_CHSR">
          <bitfield caption="Channel 0 Enable" mask="0x00000001" name="CH0"/>
          <bitfield caption="Channel 1 Enable" mask="0x00000002" name="CH1"/>
          <bitfield caption="Channel 2 Enable" mask="0x00000004" name="CH2"/>
          <bitfield caption="Channel 3 Enable" mask="0x00000008" name="CH3"/>
          <bitfield caption="Channel 4 Enable" mask="0x00000010" name="CH4"/>
          <bitfield caption="Channel 5 Enable" mask="0x00000020" name="CH5"/>
          <bitfield caption="Channel 6 Enable" mask="0x00000040" name="CH6"/>
          <bitfield caption="Channel 7 Enable" mask="0x00000080" name="CH7"/>
        </register>
        <register caption="Channel Disable Register" name="ADC_CHDR" offset="0x14" rw="W" size="4" atomic-op="clear:ADC_CHSR">
          <bitfield caption="Channel 0 Disable" mask="0x00000001" name="CH0"/>
          <bitfield caption="Channel 1 Disable" mask="0x00000002" name="CH1"/>
          <bitfield caption="Channel 2 Disable" mask="0x00000004" name="CH2"/>
          <bitfield caption="Channel 3 Disable" mask="0x00000008" name="CH3"/>
          <bitfield caption="Channel 4 Disable" mask="0x00000010" name="CH4"/>
          <bitfield caption="Channel 5 Disable" mask="0x00000020" name="CH5"/>
          <bitfield caption="Channel 6 Disable" mask="0x00000040" name="CH6"/>
          <bitfield caption="Channel 7 Disable" mask="0x00000080" name="CH7"/>
        </register>
        <register caption="Channel Status Register" name="ADC_CHSR" offset="0x18" rw="R" size="4">
          <bitfield caption="Channel 0 Status" mask="0x00000001" name="CH0"/>
          <bitfield caption="Channel 1 Status" mask="0x00000002" name="CH1"/>
          <bitfield caption="Channel 2 Status" mask="0x00000004" name="CH2"/>
          <bitfield caption="Channel 3 Status" mask="0x00000008" name="CH3"/>
          <bitfield caption="Channel 4 Status" mask="0x00000010" name="CH4"/>
          <bitfield caption="Channel 5 Status" mask="0x00000020" name="CH5"/>
          <bitfield caption="Channel 6 Status" mask="0x00000040" name="CH6"/>
          <bitfield caption="Channel 7 Status" mask="0x00000080" name="CH7"/>
        </register>
        <register caption="Last Converted Data Register" name="ADC_LCDR" offset="0x20" rw="R" size="4">
          <bitfield caption="Last Data Converted" mask="0x00000FFF" name="LDATA"/>
          <bitfield caption="Channel Number" mask="0x0000F000" name="CHNB"/>
        </register>
        <register caption="Interrupt Enable Register" name="ADC_IER" offset="0x24" rw="W" size="4" atomic-op="set:ADC_IMR">
          <bitfield caption="End of Conversion Interrupt Enable 0" mask="0x00000001" name="EOC0"/>
          <bitfield caption="End of Conversion Interrupt Enable 1" mask="0x00000002" name="EOC1"/>
          <bitfield caption="End of Conversion Interrupt Enable 2" mask="0x00000004" name="EOC2"/>
          <bitfield caption="End of Conversion Interrupt Enable 3" mask="0x00000008" name="EOC3"/>
          <bitfield caption="End of Conversion Interrupt Enable 4" mask="0x00000010" name="EOC4"/>
          <bitfield caption="End of Conversion Interrupt Enable 5" mask="0x00000020" name="EOC5"/>
          <bitfield caption="End of Conversion Interrupt Enable 6" mask="0x00000040" name="EOC6"/>
          <bitfield caption="End of Conversion Interrupt Enable 7" mask="0x00000080" name="EOC7"/>
          <bitfield caption="Last Channel Change Interrupt Enable" mask="0x00080000" name="LCCHG"/>
          <bitfield caption="End of Calibration Sequence" mask="0x00800000" name="EOCAL"/>
          <bitfield caption="Data Ready Interrupt Enable" mask="0x01000000" name="DRDY"/>
          <bitfield caption="General Overrun Error Interrupt Enable" mask="0x02000000" name="GOVRE"/>
          <bitfield caption="Comparison Event Interrupt Enable" mask="0x04000000" name="COMPE"/>
          <bitfield caption="End of Receive Buffer Interrupt Enable" mask="0x08000000" name="ENDRX"/>
          <bitfield caption="Receive Buffer Full Interrupt Enable" mask="0x10000000" name="RXBUFF"/>
        </register>
        <register caption="Interrupt Disable Register" name="ADC_IDR" offset="0x28" rw="W" size="4" atomic-op="clear:ADC_IMR">
          <bitfield caption="End of Conversion Interrupt Disable 0" mask="0x00000001" name="EOC0"/>
          <bitfield caption="End of Conversion Interrupt Disable 1" mask="0x00000002" name="EOC1"/>
          <bitfield caption="End of Conversion Interrupt Disable 2" mask="0x00000004" name="EOC2"/>
          <bitfield caption="End of Conversion Interrupt Disable 3" mask="0x00000008" name="EOC3"/>
          <bitfield caption="End of Conversion Interrupt Disable 4" mask="0x00000010" name="EOC4"/>
          <bitfield caption="End of Conversion Interrupt Disable 5" mask="0x00000020" name="EOC5"/>
          <bitfield caption="End of Conversion Interrupt Disable 6" mask="0x00000040" name="EOC6"/>
          <bitfield caption="End of Conversion Interrupt Disable 7" mask="0x00000080" name="EOC7"/>
          <bitfield caption="Last Channel Change Interrupt Disable" mask="0x00080000" name="LCCHG"/>
          <bitfield caption="End of Calibration Sequence" mask="0x00800000" name="EOCAL"/>
          <bitfield caption="Data Ready Interrupt Disable" mask="0x01000000" name="DRDY"/>
          <bitfield caption="General Overrun Error Interrupt Disable" mask="0x02000000" name="GOVRE"/>
          <bitfield caption="Comparison Event Interrupt Disable" mask="0x04000000" name="COMPE"/>
          <bitfield caption="End of Receive Buffer Interrupt Disable" mask="0x08000000" name="ENDRX"/>
          <bitfield caption="Receive Buffer Full Interrupt Disable" mask="0x10000000" name="RXBUFF"/>
        </register>
        <register caption="Interrupt Mask Register" name="ADC_IMR" offset="0x2C" rw="R" size="4" atomic-op="read:ADC_IMR">
          <bitfield caption="End of Conversion Interrupt Mask 0" mask="0x00000001" name="EOC0"/>
          <bitfield caption="End of Conversion Interrupt Mask 1" mask="0x00000002" name="EOC1"/>
          <bitfield caption="End of Conversion Interrupt Mask 2" mask="0x00000004" name="EOC2"/>
          <bitfield caption="End of Conversion Interrupt Mask 3" mask="0x00000008" name="EOC3"/>
          <bitfield caption="End of Conversion Interrupt Mask 4" mask="0x00000010" name="EOC4"/>
          <bitfield caption="End of Conversion Interrupt Mask 5" mask="0x00000020" name="EOC5"/>
          <bitfield caption="End of Conversion Interrupt Mask 6" mask="0x00000040" name="EOC6"/>
          <bitfield caption="End of Conversion Interrupt Mask 7" mask="0x00000080" name="EOC7"/>
          <bitfield caption="Last Channel Change Interrupt Mask" mask="0x00080000" name="LCCHG"/>
          <bitfield caption="End of Calibration Sequence" mask="0x00800000" name="EOCAL"/>
          <bitfield caption="Data Ready Interrupt Mask" mask="0x01000000" name="DRDY"/>
          <bitfield caption="General Overrun Error Interrupt Mask" mask="0x02000000" name="GOVRE"/>
          <bitfield caption="Comparison Event Interrupt Mask" mask="0x04000000" name="COMPE"/>
          <bitfield caption="End of Receive Buffer Interrupt Mask" mask="0x08000000" name="ENDRX"/>
          <bitfield caption="Receive Buffer Full Interrupt Mask" mask="0x10000000" name="RXBUFF"/>
        </register>
        <register caption="Interrupt Status Register" name="ADC_ISR" offset="0x30" rw="R" size="4" atomic-op="read:ADC_ISR">
          <bitfield caption="End of Conversion 0 (automatically set / cleared)" mask="0x00000001" name="EOC0"/>
          <bitfield caption="End of Conversion 1 (automatically set / cleared)" mask="0x00000002" name="EOC1"/>
          <bitfield caption="End of Conversion 2 (automatically set / cleared)" mask="0x00000004" name="EOC2"/>
          <bitfield caption="End of Conversion 3 (automatically set / cleared)" mask="0x00000008" name="EOC3"/>
          <bitfield caption="End of Conversion 4 (automatically set / cleared)" mask="0x00000010" name="EOC4"/>
          <bitfield caption="End of Conversion 5 (automatically set / cleared)" mask="0x00000020" name="EOC5"/>
          <bitfield caption="End of Conversion 6 (automatically set / cleared)" mask="0x00000040" name="EOC6"/>
          <bitfield caption="End of Conversion 7 (automatically set / cleared)" mask="0x00000080" name="EOC7"/>
          <bitfield caption="Last Channel Change (cleared on read)" mask="0x00080000" name="LCCHG"/>
          <bitfield caption="End of Calibration Sequence" mask="0x00800000" name="EOCAL"/>
          <bitfield caption="Data Ready (automatically set / cleared)" mask="0x01000000" name="DRDY"/>
          <bitfield caption="General Overrun Error (cleared on read)" mask="0x02000000" name="GOVRE"/>
          <bitfield caption="Comparison Event (cleared on read)" mask="0x04000000" name="COMPE"/>
          <bitfield caption="End of Receive Transfer (cleared by writing ADC_RCR or ADC_RNCR)" mask="0x08000000" name="ENDRX"/>
          <bitfield caption="Receive Buffer Full (cleared by writing ADC_RCR or ADC_RNCR)" mask="0x10000000" name="RXBUFF"/>
        </register>
        <register caption="Last Channel Trigger Mode Register" name="ADC_LCTMR" offset="0x34" rw="RW" size="4">
          <bitfield caption="Dual Trigger ON" mask="0x00000001" name="DUALTRIG"/>
          <bitfield caption="Last Channel Comparison Mode" mask="0x00000030" name="CMPMOD" values="ADC_LCTMR__CMPMOD"/>
        </register>
