Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.7.83/samg51/atdf/ATSAMG51G18.atdf
    <module name="MEM2MEM" caption="Memory to Memory" id="11211" version="B">
      <register-group name="MEM2MEM">
        <register caption="Memory to Memory Transfer Holding Register" name="MEM2MEM_THR" offset="0x00" rw="RW" size="4">
          <bitfield caption="Transfer Holding Data" mask="0xFFFFFFFF" name="THDATA"/>
        </register>
        <register caption="Memory to Memory Mode Register" name="MEM2MEM_MR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Transfer Size" mask="0x00000003" name="TSIZE" values="MEM2MEM_MR__TSIZE"/>
        </register>
        <register caption="Memory to Memory Interrupt Enable Register" name="MEM2MEM_IER" offset="0x08" rw="W" size="4" atomic-op="set:MEM2MEM_IMR">
          <bitfield caption="End of Transfer Interrupt Enable" mask="0x00000001" name="RXEND"/>
          <bitfield caption="Buffer Full Interrupt Enable" mask="0x00000002" name="RXBUFF"/>
        </register>
        <register caption="Memory to Memory Interrupt Disable Register" name="MEM2MEM_IDR" offset="0x0C" rw="W" size="4" atomic-op="clear:MEM2MEM_IMR">
          <bitfield caption="End of Transfer Interrupt Disable" mask="0x00000001" name="RXEND"/>
          <bitfield caption="Buffer Full Interrupt Disable" mask="0x00000002" name="RXBUFF"/>
        </register>
        <register caption="Memory to Memory Interrupt Mask Register" name="MEM2MEM_IMR" offset="0x10" rw="R" size="4" atomic-op="read:MEM2MEM_IMR">
          <bitfield caption="End of Transfer Interrupt Mask" mask="0x00000001" name="RXEND"/>
          <bitfield caption="Buffer Full Interrupt Mask" mask="0x00000002" name="RXBUFF"/>
        </register>
        <register caption="Memory to Memory Interrupt Status Register" name="MEM2MEM_ISR" offset="0x14" rw="R" size="4" atomic-op="read:MEM2MEM_ISR">
          <bitfield caption="End of Transfer" mask="0x00000001" name="RXEND"/>
          <bitfield caption="Buffer Full" mask="0x00000002" name="RXBUFF"/>
        </register>
        <register caption="Receive Pointer Register" name="MEM2MEM_RPR" offset="0x100" rw="RW" size="4">
          <bitfield caption="Receive Pointer Register" mask="0xFFFFFFFF" name="RXPTR"/>
        </register>
        <register caption="Receive Counter Register" name="MEM2MEM_RCR" offset="0x104" rw="RW" size="4">
          <bitfield caption="Receive Counter Register" mask="0x0000FFFF" name="RXCTR"/>
        </register>
        <register caption="Transmit Pointer Register" name="MEM2MEM_TPR" offset="0x108" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0xFFFFFFFF" name="TXPTR"/>
        </register>
        <register caption="Transmit Counter Register" name="MEM2MEM_TCR" offset="0x10C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0x0000FFFF" name="TXCTR"/>
        </register>
        <register caption="Receive Next Pointer Register" name="MEM2MEM_RNPR" offset="0x110" rw="RW" size="4">
          <bitfield caption="Receive Next Pointer" mask="0xFFFFFFFF" name="RXNPTR"/>
        </register>
        <register caption="Receive Next Counter Register" name="MEM2MEM_RNCR" offset="0x114" rw="RW" size="4">
          <bitfield caption="Receive Next Counter" mask="0x0000FFFF" name="RXNCTR"/>
        </register>
        <register caption="Transmit Next Pointer Register" name="MEM2MEM_TNPR" offset="0x118" rw="RW" size="4">
          <bitfield caption="Transmit Next Pointer" mask="0xFFFFFFFF" name="TXNPTR"/>
        </register>
        <register caption="Transmit Next Counter Register" name="MEM2MEM_TNCR" offset="0x11C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Next" mask="0x0000FFFF" name="TXNCTR"/>
        </register>
        <register caption="Transfer Control Register" name="MEM2MEM_PTCR" offset="0x120" rw="W" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Receiver Transfer Disable" mask="0x00000002" name="RXTDIS"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Transmitter Transfer Disable" mask="0x00000200" name="TXTDIS"/>
        </register>
        <register caption="Transfer Status Register" name="MEM2MEM_PTSR" offset="0x124" rw="R" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
        </register>
      </register-group>
      <value-group caption="" name="MEM2MEM_MR__TSIZE">
        <value caption="The buffer size is defined in byte." name="T_8BIT" value="0x0"/>
        <value caption="The buffer size is defined in half-word (16-bit)." name="T_16BIT" value="0x1"/>
        <value caption="The buffer size is defined in word (32-bit). Default value." name="T_32BIT" value="0x2"/>
      </value-group>
    </module>
    <module name="PDC" caption="Peripheral DMA Controller" id="6031" version="I">
      <register-group name="PDC">
        <register caption="Receive Pointer Register" name="PERIPH_RPR" offset="0x00" rw="RW" size="4">
          <bitfield caption="Receive Pointer Register" mask="0xFFFFFFFF" name="RXPTR"/>
        </register>
        <register caption="Receive Counter Register" name="PERIPH_RCR" offset="0x04" rw="RW" size="4">
          <bitfield caption="Receive Counter Register" mask="0x0000FFFF" name="RXCTR"/>
        </register>
        <register caption="Transmit Pointer Register" name="PERIPH_TPR" offset="0x08" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0xFFFFFFFF" name="TXPTR"/>
        </register>
        <register caption="Transmit Counter Register" name="PERIPH_TCR" offset="0x0C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Register" mask="0x0000FFFF" name="TXCTR"/>
        </register>
        <register caption="Receive Next Pointer Register" name="PERIPH_RNPR" offset="0x10" rw="RW" size="4">
          <bitfield caption="Receive Next Pointer" mask="0xFFFFFFFF" name="RXNPTR"/>
        </register>
        <register caption="Receive Next Counter Register" name="PERIPH_RNCR" offset="0x14" rw="RW" size="4">
          <bitfield caption="Receive Next Counter" mask="0x0000FFFF" name="RXNCTR"/>
        </register>
        <register caption="Transmit Next Pointer Register" name="PERIPH_TNPR" offset="0x18" rw="RW" size="4">
          <bitfield caption="Transmit Next Pointer" mask="0xFFFFFFFF" name="TXNPTR"/>
        </register>
        <register caption="Transmit Next Counter Register" name="PERIPH_TNCR" offset="0x1C" rw="RW" size="4">
          <bitfield caption="Transmit Counter Next" mask="0x0000FFFF" name="TXNCTR"/>
        </register>
        <register caption="Transfer Control Register" name="PERIPH_PTCR" offset="0x20" rw="W" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Receiver Transfer Disable" mask="0x00000002" name="RXTDIS"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
          <bitfield caption="Transmitter Transfer Disable" mask="0x00000200" name="TXTDIS"/>
        </register>
        <register caption="Transfer Status Register" name="PERIPH_PTSR" offset="0x24" rw="R" size="4">
          <bitfield caption="Receiver Transfer Enable" mask="0x00000001" name="RXTEN"/>
          <bitfield caption="Transmitter Transfer Enable" mask="0x00000100" name="TXTEN"/>
        </register>
      </register-group>
    </module>
    <module name="PIO" caption="Parallel Input/Output Controller" id="11004" version="R">
      <register-group name="PIO">
        <register caption="Enable Register" name="PIO_PER" offset="0x0000" rw="W" size="4" atomic-op="set:PIO_PSR">
          <bitfield caption="Enable" mask="0x00000001" name="P0"/>
          <bitfield caption="Enable" mask="0x00000002" name="P1"/>
          <bitfield caption="Enable" mask="0x00000004" name="P2"/>
          <bitfield caption="Enable" mask="0x00000008" name="P3"/>
          <bitfield caption="Enable" mask="0x00000010" name="P4"/>
          <bitfield caption="Enable" mask="0x00000020" name="P5"/>
          <bitfield caption="Enable" mask="0x00000040" name="P6"/>
          <bitfield caption="Enable" mask="0x00000080" name="P7"/>
          <bitfield caption="Enable" mask="0x00000100" name="P8"/>
          <bitfield caption="Enable" mask="0x00000200" name="P9"/>
          <bitfield caption="Enable" mask="0x00000400" name="P10"/>
          <bitfield caption="Enable" mask="0x00000800" name="P11"/>
          <bitfield caption="Enable" mask="0x00001000" name="P12"/>
          <bitfield caption="Enable" mask="0x00002000" name="P13"/>
          <bitfield caption="Enable" mask="0x00004000" name="P14"/>
          <bitfield caption="Enable" mask="0x00008000" name="P15"/>
          <bitfield caption="Enable" mask="0x00010000" name="P16"/>
          <bitfield caption="Enable" mask="0x00020000" name="P17"/>
          <bitfield caption="Enable" mask="0x00040000" name="P18"/>
          <bitfield caption="Enable" mask="0x00080000" name="P19"/>
          <bitfield caption="Enable" mask="0x00100000" name="P20"/>
          <bitfield caption="Enable" mask="0x00200000" name="P21"/>
          <bitfield caption="Enable" mask="0x00400000" name="P22"/>
          <bitfield caption="Enable" mask="0x00800000" name="P23"/>
          <bitfield caption="Enable" mask="0x01000000" name="P24"/>
          <bitfield caption="Enable" mask="0x02000000" name="P25"/>
          <bitfield caption="Enable" mask="0x04000000" name="P26"/>
          <bitfield caption="Enable" mask="0x08000000" name="P27"/>
          <bitfield caption="Enable" mask="0x10000000" name="P28"/>
          <bitfield caption="Enable" mask="0x20000000" name="P29"/>
          <bitfield caption="Enable" mask="0x40000000" name="P30"/>
          <bitfield caption="Enable" mask="0x80000000" name="P31"/>
        </register>
        <register caption="Disable Register" name="PIO_PDR" offset="0x0004" rw="W" size="4" atomic-op="clear:PIO_PSR">
          <bitfield caption="Disable" mask="0x00000001" name="P0"/>
          <bitfield caption="Disable" mask="0x00000002" name="P1"/>
          <bitfield caption="Disable" mask="0x00000004" name="P2"/>
          <bitfield caption="Disable" mask="0x00000008" name="P3"/>
          <bitfield caption="Disable" mask="0x00000010" name="P4"/>
          <bitfield caption="Disable" mask="0x00000020" name="P5"/>
          <bitfield caption="Disable" mask="0x00000040" name="P6"/>
          <bitfield caption="Disable" mask="0x00000080" name="P7"/>
          <bitfield caption="Disable" mask="0x00000100" name="P8"/>
          <bitfield caption="Disable" mask="0x00000200" name="P9"/>
          <bitfield caption="Disable" mask="0x00000400" name="P10"/>
          <bitfield caption="Disable" mask="0x00000800" name="P11"/>
          <bitfield caption="Disable" mask="0x00001000" name="P12"/>
          <bitfield caption="Disable" mask="0x00002000" name="P13"/>
          <bitfield caption="Disable" mask="0x00004000" name="P14"/>
          <bitfield caption="Disable" mask="0x00008000" name="P15"/>
          <bitfield caption="Disable" mask="0x00010000" name="P16"/>
          <bitfield caption="Disable" mask="0x00020000" name="P17"/>
          <bitfield caption="Disable" mask="0x00040000" name="P18"/>
          <bitfield caption="Disable" mask="0x00080000" name="P19"/>
          <bitfield caption="Disable" mask="0x00100000" name="P20"/>
          <bitfield caption="Disable" mask="0x00200000" name="P21"/>
          <bitfield caption="Disable" mask="0x00400000" name="P22"/>
          <bitfield caption="Disable" mask="0x00800000" name="P23"/>
          <bitfield caption="Disable" mask="0x01000000" name="P24"/>
          <bitfield caption="Disable" mask="0x02000000" name="P25"/>
          <bitfield caption="Disable" mask="0x04000000" name="P26"/>
          <bitfield caption="Disable" mask="0x08000000" name="P27"/>
          <bitfield caption="Disable" mask="0x10000000" name="P28"/>
          <bitfield caption="Disable" mask="0x20000000" name="P29"/>
          <bitfield caption="Disable" mask="0x40000000" name="P30"/>
          <bitfield caption="Disable" mask="0x80000000" name="P31"/>
        </register>
        <register caption="Status Register" name="PIO_PSR" offset="0x0008" rw="R" size="4">
          <bitfield caption="Status" mask="0x00000001" name="P0"/>
          <bitfield caption="Status" mask="0x00000002" name="P1"/>
          <bitfield caption="Status" mask="0x00000004" name="P2"/>
          <bitfield caption="Status" mask="0x00000008" name="P3"/>
          <bitfield caption="Status" mask="0x00000010" name="P4"/>
          <bitfield caption="Status" mask="0x00000020" name="P5"/>
          <bitfield caption="Status" mask="0x00000040" name="P6"/>
          <bitfield caption="Status" mask="0x00000080" name="P7"/>
          <bitfield caption="Status" mask="0x00000100" name="P8"/>
          <bitfield caption="Status" mask="0x00000200" name="P9"/>
          <bitfield caption="Status" mask="0x00000400" name="P10"/>
          <bitfield caption="Status" mask="0x00000800" name="P11"/>
          <bitfield caption="Status" mask="0x00001000" name="P12"/>
          <bitfield caption="Status" mask="0x00002000" name="P13"/>
          <bitfield caption="Status" mask="0x00004000" name="P14"/>
          <bitfield caption="Status" mask="0x00008000" name="P15"/>
          <bitfield caption="Status" mask="0x00010000" name="P16"/>
          <bitfield caption="Status" mask="0x00020000" name="P17"/>
          <bitfield caption="Status" mask="0x00040000" name="P18"/>
          <bitfield caption="Status" mask="0x00080000" name="P19"/>
          <bitfield caption="Status" mask="0x00100000" name="P20"/>
          <bitfield caption="Status" mask="0x00200000" name="P21"/>
          <bitfield caption="Status" mask="0x00400000" name="P22"/>
          <bitfield caption="Status" mask="0x00800000" name="P23"/>
          <bitfield caption="Status" mask="0x01000000" name="P24"/>
          <bitfield caption="Status" mask="0x02000000" name="P25"/>
          <bitfield caption="Status" mask="0x04000000" name="P26"/>
          <bitfield caption="Status" mask="0x08000000" name="P27"/>
          <bitfield caption="Status" mask="0x10000000" name="P28"/>
          <bitfield caption="Status" mask="0x20000000" name="P29"/>
          <bitfield caption="Status" mask="0x40000000" name="P30"/>
          <bitfield caption="Status" mask="0x80000000" name="P31"/>
        </register>
        <register caption="Output Enable Register" name="PIO_OER" offset="0x0010" rw="W" size="4" atomic-op="set:PIO_OSR">
          <bitfield caption="Output Enable" mask="0x00000001" name="P0"/>
          <bitfield caption="Output Enable" mask="0x00000002" name="P1"/>
          <bitfield caption="Output Enable" mask="0x00000004" name="P2"/>
          <bitfield caption="Output Enable" mask="0x00000008" name="P3"/>
          <bitfield caption="Output Enable" mask="0x00000010" name="P4"/>
          <bitfield caption="Output Enable" mask="0x00000020" name="P5"/>
          <bitfield caption="Output Enable" mask="0x00000040" name="P6"/>
          <bitfield caption="Output Enable" mask="0x00000080" name="P7"/>
          <bitfield caption="Output Enable" mask="0x00000100" name="P8"/>
          <bitfield caption="Output Enable" mask="0x00000200" name="P9"/>
          <bitfield caption="Output Enable" mask="0x00000400" name="P10"/>
          <bitfield caption="Output Enable" mask="0x00000800" name="P11"/>
          <bitfield caption="Output Enable" mask="0x00001000" name="P12"/>
          <bitfield caption="Output Enable" mask="0x00002000" name="P13"/>
          <bitfield caption="Output Enable" mask="0x00004000" name="P14"/>
          <bitfield caption="Output Enable" mask="0x00008000" name="P15"/>
          <bitfield caption="Output Enable" mask="0x00010000" name="P16"/>
          <bitfield caption="Output Enable" mask="0x00020000" name="P17"/>
          <bitfield caption="Output Enable" mask="0x00040000" name="P18"/>
          <bitfield caption="Output Enable" mask="0x00080000" name="P19"/>
          <bitfield caption="Output Enable" mask="0x00100000" name="P20"/>
          <bitfield caption="Output Enable" mask="0x00200000" name="P21"/>
          <bitfield caption="Output Enable" mask="0x00400000" name="P22"/>
          <bitfield caption="Output Enable" mask="0x00800000" name="P23"/>
          <bitfield caption="Output Enable" mask="0x01000000" name="P24"/>
          <bitfield caption="Output Enable" mask="0x02000000" name="P25"/>
          <bitfield caption="Output Enable" mask="0x04000000" name="P26"/>
          <bitfield caption="Output Enable" mask="0x08000000" name="P27"/>
          <bitfield caption="Output Enable" mask="0x10000000" name="P28"/>
          <bitfield caption="Output Enable" mask="0x20000000" name="P29"/>
          <bitfield caption="Output Enable" mask="0x40000000" name="P30"/>
          <bitfield caption="Output Enable" mask="0x80000000" name="P31"/>
        </register>
        <register caption="Output Disable Register" name="PIO_ODR" offset="0x0014" rw="W" size="4" atomic-op="clear:PIO_OSR">
          <bitfield caption="Output Disable" mask="0x00000001" name="P0"/>
          <bitfield caption="Output Disable" mask="0x00000002" name="P1"/>
          <bitfield caption="Output Disable" mask="0x00000004" name="P2"/>
          <bitfield caption="Output Disable" mask="0x00000008" name="P3"/>
          <bitfield caption="Output Disable" mask="0x00000010" name="P4"/>
          <bitfield caption="Output Disable" mask="0x00000020" name="P5"/>
          <bitfield caption="Output Disable" mask="0x00000040" name="P6"/>
          <bitfield caption="Output Disable" mask="0x00000080" name="P7"/>
          <bitfield caption="Output Disable" mask="0x00000100" name="P8"/>
          <bitfield caption="Output Disable" mask="0x00000200" name="P9"/>
          <bitfield caption="Output Disable" mask="0x00000400" name="P10"/>
          <bitfield caption="Output Disable" mask="0x00000800" name="P11"/>
          <bitfield caption="Output Disable" mask="0x00001000" name="P12"/>
          <bitfield caption="Output Disable" mask="0x00002000" name="P13"/>
          <bitfield caption="Output Disable" mask="0x00004000" name="P14"/>
          <bitfield caption="Output Disable" mask="0x00008000" name="P15"/>
          <bitfield caption="Output Disable" mask="0x00010000" name="P16"/>
          <bitfield caption="Output Disable" mask="0x00020000" name="P17"/>
          <bitfield caption="Output Disable" mask="0x00040000" name="P18"/>
          <bitfield caption="Output Disable" mask="0x00080000" name="P19"/>
          <bitfield caption="Output Disable" mask="0x00100000" name="P20"/>
          <bitfield caption="Output Disable" mask="0x00200000" name="P21"/>
          <bitfield caption="Output Disable" mask="0x00400000" name="P22"/>
          <bitfield caption="Output Disable" mask="0x00800000" name="P23"/>
          <bitfield caption="Output Disable" mask="0x01000000" name="P24"/>
          <bitfield caption="Output Disable" mask="0x02000000" name="P25"/>
          <bitfield caption="Output Disable" mask="0x04000000" name="P26"/>
          <bitfield caption="Output Disable" mask="0x08000000" name="P27"/>
          <bitfield caption="Output Disable" mask="0x10000000" name="P28"/>
          <bitfield caption="Output Disable" mask="0x20000000" name="P29"/>
          <bitfield caption="Output Disable" mask="0x40000000" name="P30"/>
          <bitfield caption="Output Disable" mask="0x80000000" name="P31"/>
        </register>
        <register caption="Output Status Register" name="PIO_OSR" offset="0x0018" rw="R" size="4">
          <bitfield caption="Output Status" mask="0x00000001" name="P0"/>
          <bitfield caption="Output Status" mask="0x00000002" name="P1"/>
          <bitfield caption="Output Status" mask="0x00000004" name="P2"/>
          <bitfield caption="Output Status" mask="0x00000008" name="P3"/>
          <bitfield caption="Output Status" mask="0x00000010" name="P4"/>
          <bitfield caption="Output Status" mask="0x00000020" name="P5"/>
          <bitfield caption="Output Status" mask="0x00000040" name="P6"/>
          <bitfield caption="Output Status" mask="0x00000080" name="P7"/>
          <bitfield caption="Output Status" mask="0x00000100" name="P8"/>
          <bitfield caption="Output Status" mask="0x00000200" name="P9"/>
          <bitfield caption="Output Status" mask="0x00000400" name="P10"/>
          <bitfield caption="Output Status" mask="0x00000800" name="P11"/>
          <bitfield caption="Output Status" mask="0x00001000" name="P12"/>
          <bitfield caption="Output Status" mask="0x00002000" name="P13"/>
          <bitfield caption="Output Status" mask="0x00004000" name="P14"/>
          <bitfield caption="Output Status" mask="0x00008000" name="P15"/>
          <bitfield caption="Output Status" mask="0x00010000" name="P16"/>
          <bitfield caption="Output Status" mask="0x00020000" name="P17"/>
          <bitfield caption="Output Status" mask="0x00040000" name="P18"/>
          <bitfield caption="Output Status" mask="0x00080000" name="P19"/>
          <bitfield caption="Output Status" mask="0x00100000" name="P20"/>
          <bitfield caption="Output Status" mask="0x00200000" name="P21"/>
          <bitfield caption="Output Status" mask="0x00400000" name="P22"/>
          <bitfield caption="Output Status" mask="0x00800000" name="P23"/>
          <bitfield caption="Output Status" mask="0x01000000" name="P24"/>
          <bitfield caption="Output Status" mask="0x02000000" name="P25"/>
          <bitfield caption="Output Status" mask="0x04000000" name="P26"/>
          <bitfield caption="Output Status" mask="0x08000000" name="P27"/>
          <bitfield caption="Output Status" mask="0x10000000" name="P28"/>
          <bitfield caption="Output Status" mask="0x20000000" name="P29"/>
          <bitfield caption="Output Status" mask="0x40000000" name="P30"/>
          <bitfield caption="Output Status" mask="0x80000000" name="P31"/>
        </register>
