Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMG_DFP/3.7.83/samg51/atdf/ATSAMG51G18.atdf
        <register offset="0x00000004" size="4" name="MPU_CTRL" initval="0x00000000" caption="MPU Control Register" rw="RW">
          <bitfield mask="0x00000001" name="ENABLE" caption="Enables the MPU"/>
          <bitfield mask="0x00000002" name="HFNMIENA" caption="Enables the operation of MPU during hard fault, NMI, and FAULTMASK handlers."/>
          <bitfield mask="0x00000004" name="PRIVDEFENA" caption="Enables privileged software access to the default memory map."/>
        </register>
        <register offset="0x00000008" size="4" name="MPU_RNR" initval="0x00000000" caption="MPU Region Number Register" rw="RW">
          <bitfield mask="0x000000FF" name="REGION" caption="Indicates the MPU region referenced by the MPU_RBAR and MPU_RASR registers."/>
        </register>
        <register offset="0x0000000C" size="4" name="MPU_RBAR" initval="0x00000000" caption="MPU Region Base Address Register" rw="RW">
          <bitfield mask="0x0000000F" name="REGION" caption="MPU region field."/>
          <bitfield mask="0x00000010" name="VALID" caption="MPU Region Number valid bit."/>
          <bitfield mask="0xFFFFFFE0" name="ADDR" caption="Region base address field."/>
        </register>
        <register offset="0x00000010" size="4" name="MPU_RASR" initval="0x00000000" caption="MPU Region Attribute and Size Register" rw="RW">
          <bitfield mask="0x00000001" name="ENABLE" caption="Region enable bit."/>
          <bitfield mask="0x0000003E" name="SIZE" caption="Specifies the size of the MPU protection region."/>
          <bitfield mask="0x0000FF00" name="SRD" caption="Subregion disable bits."/>
          <bitfield mask="0x00010000" name="B" caption="MPU access permission attributes."/>
          <bitfield mask="0x00020000" name="C" caption="MPU access permission attributes."/>
          <bitfield mask="0x00040000" name="S" caption="Shareable bit."/>
          <bitfield mask="0x00380000" name="TEX" caption="MPU access permission attributes."/>
          <bitfield mask="0x07000000" name="AP" caption="Access permission field."/>
          <bitfield mask="0x10000000" name="XN" caption="Instruction access disable bit."/>
        </register>
      </register-group>
    </module>
    <module name="ICE" caption="In-Circuit Emulator (JTAG/SWD/SWO)"/>
  </modules>
  <pinouts>
    <pinout name="WLCSP49">
      <pin position="C7" pad="PA0"/>
      <pin position="D5" pad="PA1"/>
      <pin position="B4" pad="PA2"/>
      <pin position="C6" pad="PA3"/>
      <pin position="C5" pad="PA4"/>
      <pin position="D6" pad="PA5"/>
      <pin position="G7" pad="PA6"/>
      <pin position="E7" pad="PA7"/>
      <pin position="F7" pad="PA8"/>
      <pin position="A1" pad="PA9"/>
      <pin position="E5" pad="PA10"/>
      <pin position="C2" pad="PA11"/>
      <pin position="C3" pad="PA12"/>
      <pin position="D1" pad="PA13"/>
      <pin position="E4" pad="PA14"/>
      <pin position="G6" pad="PA15"/>
      <pin position="F6" pad="PA16"/>
      <pin position="F3" pad="PA17"/>
      <pin position="E3" pad="PA18"/>
      <pin position="F2" pad="PA19"/>
      <pin position="F1" pad="PA20"/>
      <pin position="F4" pad="PA21"/>
      <pin position="G5" pad="PA22"/>
      <pin position="F5" pad="PA23"/>
      <pin position="A3" pad="PA24"/>
      <pin position="E2" pad="PB0"/>
      <pin position="D3" pad="PB1"/>
      <pin position="E1" pad="PB2"/>
      <pin position="D2" pad="PB3"/>
      <pin position="A6" pad="PB4"/>
      <pin position="B2" pad="PB5"/>
      <pin position="C4" pad="PB6"/>
      <pin position="B3" pad="PB7"/>
      <pin position="A4" pad="PB8"/>
      <pin position="A5" pad="PB9"/>
      <pin position="D4" pad="PB10"/>
      <pin position="B1" pad="PB11"/>
      <pin position="B7" pad="PB12"/>
      <pin position="G2" pad="VDDOUT"/>
      <pin position="B6" pad="NRST"/>
      <pin position="E6" pad="TST"/>
      <pin position="G4" pad="VDDIO"/>
      <pin position="G1" pad="VDDIO"/>
      <pin position="A7" pad="VDDIO"/>
      <pin position="B5" pad="JTAGSEL"/>
      <pin position="C1" pad="VDDCORE"/>
      <pin position="D7" pad="VDDCORE"/>
      <pin position="A2" pad="GND"/>
      <pin position="G3" pad="GND"/>
    </pinout>
  </pinouts>
</avr-tools-device-file>
